GrumpyOldPizza/ArduinoCore-stm32l0/libraries/GNSS/src/utility/gnss_core.c
#define NMEA_FIELD_MASK_TIME                          0x0001
#define NMEA_FIELD_MASK_POSITION                      0x0002
#define NMEA_FIELD_MASK_ALTITUDE                      0x0004
#define NMEA_FIELD_MASK_SPEED                         0x0008
#define NMEA_FIELD_MASK_COURSE                        0x0010
#define NMEA_FIELD_MASK_EHPE                          0x0020
#define NMEA_FIELD_MASK_EVPE                          0x0040
#define NMEA_FIELD_MASK_PDOP                          0x0080
#define NMEA_FIELD_MASK_HDOP                          0x0100
#define NMEA_FIELD_MASK_VDOP                          0x0200

#define NMEA_OPERATION_MANUAL                         0
#define NMEA_OPERATION_AUTOMATIC                      1

#define NMEA_NAVIGATION_NONE                          0
#define NMEA_NAVIGATION_2D                            1
#define NMEA_NAVIGATION_3D                            2

#define NMEA_STATUS_RECEIVER_WARNING                  0
#define NMEA_STATUS_DATA_VALID                        1

typedef struct _nmea_context_t {
    uint8_t             prefix;                             /* NMEA PREFIX (GP, GL, GN)     */
    uint8_t             sequence;                           /* FIELD SEQUENCE               */
    uint16_t            mask;                               /* FIELD MASK                   */
    uint8_t             navigation;                         /* GSA                          */
    uint8_t             status;                             /* RMC                          */
    uint8_t             sv_in_view_sentences;               /* GSV                          */
    uint8_t             sv_in_view_count;                   /* GSV                          */
    uint8_t             sv_in_view_index;                   /* GSV                          */
    uint8_t             sv_used_count;                      /* GSA                          */
    uint32_t            sv_used_mask[3];                    /* GSA                          */
    uint16_t            mtk_command;
    uint16_t            mtk_status;
} nmea_context_t;

/************************************************************************************/

#define UBX_MESSAGE_MASK_NAV_DOP                      0x00010000
#define UBX_MESSAGE_MASK_NAV_PVT                      0x00040000
#define UBX_MESSAGE_MASK_NAV_SVINFO                   0x00100000
#define UBX_MESSAGE_MASK_NAV_TIMEGPS                  0x00200000
#define UBX_MESSAGE_MASK_SOLUTION                     0x00008000

typedef struct _ubx_context_t {
    uint8_t             ck_a;
    uint8_t             ck_b;
    uint16_t            message;
    uint16_t            length;
    uint16_t            week;
    uint32_t            tow;
    uint32_t            itow;
    stm32l0_rtc_timer_t timeout;
} ubx_context_t;

/************************************************************************************/

#define GNSS_STATE_START              0
#define GNSS_STATE_NMEA_PAYLOAD       1
#define GNSS_STATE_NMEA_CHECKSUM_1    2
#define GNSS_STATE_NMEA_CHECKSUM_2    3
#define GNSS_STATE_NMEA_END_CR        4
#define GNSS_STATE_NMEA_END_LF        5
#define GNSS_STATE_UBX_SYNC_2         6
#define GNSS_STATE_UBX_MESSAGE_1      7
#define GNSS_STATE_UBX_MESSAGE_2      8
#define GNSS_STATE_UBX_LENGTH_1       9
#define GNSS_STATE_UBX_LENGTH_2       10
#define GNSS_STATE_UBX_PAYLOAD        11
#define GNSS_STATE_UBX_CK_A           12
#define GNSS_STATE_UBX_CK_B           13

#define GNSS_INIT_DONE                0
#define GNSS_INIT_MTK_BAUD_RATE       1
#define GNSS_INIT_MTK_INIT_TABLE      2
#define GNSS_INIT_UBX_BAUD_RATE       3
#define GNSS_INIT_UBX_INIT_TABLE      4

#define GNSS_RESPONSE_NONE            0
#define GNSS_RESPONSE_ACK             1
#define GNSS_RESPONSE_NACK            2
#define GNSS_RESPONSE_STARTUP         3
#define GNSS_RESPONSE_NMEA_SENTENCE   4
#define GNSS_RESPONSE_UBX_MESSAGE     5

#define GNSS_RX_DATA_SIZE             96
#define GNSS_TX_DATA_SIZE             64 /* UBX SET PERIODIC */
#define GNSS_TX_TABLE_COUNT           8  /* UBX SET PERIODIC */

typedef struct _gnss_device_t {
    uint8_t             ck_a;
    uint8_t             mode;
    uint8_t             state;
    volatile uint8_t    busy;
    volatile uint8_t    init;
    uint32_t            seen;
    uint32_t            expected;
    uint16_t            checksum;
    uint16_t            rx_count;
    uint16_t            rx_offset;
    uint16_t            rx_chunk;
    const uint8_t * const * volatile table;
    uint8_t             rx_data[GNSS_RX_DATA_SIZE];
    uint8_t             tx_data[GNSS_TX_DATA_SIZE];
    const uint8_t       *tx_table[GNSS_TX_TABLE_COUNT];
    nmea_context_t      nmea;
    ubx_context_t       ubx;
    gnss_location_t     location;
    gnss_satellites_t   satellites;
    volatile uint32_t   command;
    gnss_send_routine_t send_routine;
    gnss_location_callback_t location_callback;
    gnss_satellites_callback_t satellites_callback;
    void                *context;
} gnss_device_t;

static gnss_device_t gnss_device;

static void gnss_send_callback(void);
static void mtk_configure(gnss_device_t *device, unsigned int response, uint32_t command);
static void ubx_configure(gnss_device_t *device, unsigned int response, uint32_t command);

/************************************************************************************/

static const uint16_t utc_days_since_month[2][12] = {
    {   0,  31,  59,  90, 120, 151, 181, 212, 243, 273, 304, 334, },
    {   0,  31,  60,  91, 121, 152, 182, 213, 244, 274, 305, 335, },
};

static int utc_diff_time(const utc_time_t *t0, uint32_t offset0, const utc_time_t *t1, uint32_t offset1)
{
    /* The difference between t0 and t1 in seconds.
     */
  return (((((((((t0->year * 365 + (1 + ((t0->year -1) / 4))) +
		 utc_days_since_month[(t0->year & 3) == 0][t0->month -1] +
		 (t0->day -1)) -
		((t1->year * 365 + (1 + ((t1->year -1) / 4))) +
		   utc_days_since_month[(t1->year & 3) == 0][t1->month -1] +
		 (t1->day -1))) * 24) +
	      t0->hour -
	      t1->hour) * 60) +
	    t0->minute -
	    t1->minute) * 60) +
	  (t0->second + offset0) -
	  (t1->second + offset1));
}

/* utc_offset_time:
 *
 * Compute the UTC offset (or GPS leap second) by computing the elapsed UTC seconds
 * since 01/06/1980, and subtract that from week/tow (which is ahead by said 
 * leap seconds).
 */

