GrumpyOldPizza/ArduinoCore-stm32l0/libraries/GNSS/src/utility/gnss_core.c
	    device->location.time.hour   = time.hour;
	    device->location.time.minute = time.minute;
	    device->location.time.second = time.second;
	    device->location.time.millis = time.millis;
	}
	else
	{
	    sequence_next = NMEA_FIELD_SEQUENCE_SKIP;
	}
	break;

    case NMEA_FIELD_SEQUENCE_GGA_LATITUDE:
	if (data[0] == '\0')
	{
	    context->mask &= ~NMEA_FIELD_MASK_POSITION;
	}
	else if (nmea_parse_latitude(data, &latitude))
	{
	    device->location.latitude = latitude;
	}
	else
	{
	    sequence_next = NMEA_FIELD_SEQUENCE_SKIP;
	}
	break;

    case NMEA_FIELD_SEQUENCE_GGA_LATITUDE_NS:
	if (context->mask & NMEA_FIELD_MASK_POSITION)
	{
	    if (data[0] == 'S')
	    {
		device->location.latitude = - device->location.latitude;
	    }
	    else if (data[0] != 'N')
	    {
		sequence_next = NMEA_FIELD_SEQUENCE_SKIP;
	    }
	}
	break;

    case NMEA_FIELD_SEQUENCE_GGA_LONGITUDE:
	if (data[0] == '\0')
	{
	    context->mask &= ~NMEA_FIELD_MASK_POSITION;
	}
	else if (nmea_parse_longitude(data, &longitude))
	{
	    device->location.longitude = longitude;
	}
	else
	{
	    sequence_next = NMEA_FIELD_SEQUENCE_SKIP;
	}
	break;

    case NMEA_FIELD_SEQUENCE_GGA_LONGITUDE_EW:
	if (context->mask & NMEA_FIELD_MASK_POSITION)
	{
	    if (data[0] == 'W')
	    {
		device->location.longitude = - device->location.longitude;
	    }
	    else if (data[0] != 'E')
	    {
		sequence_next = NMEA_FIELD_SEQUENCE_SKIP;
	    }
	}
	break;

    case NMEA_FIELD_SEQUENCE_GGA_QUALITY:
	if ((data[0] == '\0') || !nmea_parse_unsigned(data, &quality))
	{
	    sequence_next = NMEA_FIELD_SEQUENCE_SKIP;
	}
	else
	{
	    device->location.quality = quality;
	}
	break;

    case NMEA_FIELD_SEQUENCE_GGA_HDOP:
	if (data[0] == '\0')
	{
	    context->mask &= ~NMEA_FIELD_MASK_HDOP;
	}
	else if (nmea_parse_fixed(data, &hdop, 2))
	{
	    device->location.hdop = hdop;
	}
	else
	{
	    sequence_next = NMEA_FIELD_SEQUENCE_SKIP;
	}
	break;

    case NMEA_FIELD_SEQUENCE_GGA_ALTITUDE:
	if (data[0] == '\0')
	{
	    context->mask &= ~NMEA_FIELD_MASK_ALTITUDE;
	}
	else if (nmea_parse_fixed(((data[0] == '-') ? data+1 : data), &altitude, 3))
	{
	    if (data[0] == '-')
	    {
		device->location.altitude = -altitude;
	    }
	    else
	    {
		device->location.altitude = altitude;
	    }
	}
	else
	{
	    sequence_next = NMEA_FIELD_SEQUENCE_SKIP;
	}
	break;

    case NMEA_FIELD_SEQUENCE_GGA_ALTITUDE_UNIT:
	if (context->mask & NMEA_FIELD_MASK_ALTITUDE)
	{
	    if (data[0] != 'M')
	    {
		sequence_next = NMEA_FIELD_SEQUENCE_SKIP;
	    }
	}
	break;

    case NMEA_FIELD_SEQUENCE_GGA_SEPARATION:
	if (data[0] == '\0')
	{
	    context->mask &= ~NMEA_FIELD_MASK_ALTITUDE;
	}
	else if (nmea_parse_fixed(((data[0] == '-') ? data+1 : data), &separation, 3))
	{
	    if (context->mask & NMEA_FIELD_MASK_ALTITUDE)
	    {
		if (data[0] == '-')
		{
		    device->location.separation = -separation;
		}
		else
		{
		    device->location.separation = separation;
		}
	    }
	}
	else
	{
	    sequence_next = NMEA_FIELD_SEQUENCE_SKIP;
	}
	break;

    case NMEA_FIELD_SEQUENCE_GGA_SEPARATION_UNIT:
	if (context->mask & NMEA_FIELD_MASK_ALTITUDE)
	{
	    if (data[0] != 'M')
	    {
		sequence_next = NMEA_FIELD_SEQUENCE_SKIP;
	    }
	}
	break;

    case NMEA_FIELD_SEQUENCE_GGA_NUMSV:
    case NMEA_FIELD_SEQUENCE_GGA_DIFFERENTIAL_AGE:
    case NMEA_FIELD_SEQUENCE_GSA_OPERATION:
    case NMEA_FIELD_SEQUENCE_GSA_HDOP:
    case NMEA_FIELD_SEQUENCE_GST_RANGE:
    case NMEA_FIELD_SEQUENCE_GST_STDDEV_MAJOR:
    case NMEA_FIELD_SEQUENCE_GST_STDDEV_MINOR:
    case NMEA_FIELD_SEQUENCE_GST_ORIENTATION:
    case NMEA_FIELD_SEQUENCE_RMC_LATITUDE:
    case NMEA_FIELD_SEQUENCE_RMC_LATITUDE_NS:
    case NMEA_FIELD_SEQUENCE_RMC_LONGITUDE:
    case NMEA_FIELD_SEQUENCE_RMC_LONGITUDE_EW:
    case NMEA_FIELD_SEQUENCE_RMC_VARIATION:
    case NMEA_FIELD_SEQUENCE_RMC_VARIATION_UNIT:
	/* SKIP FIELD */
	break;

    case NMEA_FIELD_SEQUENCE_GGA_DIFFERENTIAL_STATION:
	/* SKIP FIELD */
	sequence_next = NMEA_FIELD_SEQUENCE_GGA_END;
	break;

    case NMEA_FIELD_SEQUENCE_GSA_NAVIGATION:
	if (data[0] == '1')
	{
	    context->navigation = NMEA_NAVIGATION_NONE;
	}
	else if (data[0] == '2')
	{
	    context->navigation = NMEA_NAVIGATION_2D;
	}
	else if (data[0] == '3')
	{
	    context->navigation = NMEA_NAVIGATION_3D;
	}
	else
	{
	    sequence_next = NMEA_FIELD_SEQUENCE_SKIP;
	}
	break;

    case NMEA_FIELD_SEQUENCE_GSA_SV_USED_PRN_1:
    case NMEA_FIELD_SEQUENCE_GSA_SV_USED_PRN_2:
    case NMEA_FIELD_SEQUENCE_GSA_SV_USED_PRN_3:
    case NMEA_FIELD_SEQUENCE_GSA_SV_USED_PRN_4:
    case NMEA_FIELD_SEQUENCE_GSA_SV_USED_PRN_5:
    case NMEA_FIELD_SEQUENCE_GSA_SV_USED_PRN_6:
    case NMEA_FIELD_SEQUENCE_GSA_SV_USED_PRN_7:
    case NMEA_FIELD_SEQUENCE_GSA_SV_USED_PRN_8:
    case NMEA_FIELD_SEQUENCE_GSA_SV_USED_PRN_9:
    case NMEA_FIELD_SEQUENCE_GSA_SV_USED_PRN_10:
    case NMEA_FIELD_SEQUENCE_GSA_SV_USED_PRN_11:
    case NMEA_FIELD_SEQUENCE_GSA_SV_USED_PRN_12:
	if (data[0] != '\0')
	{
	    if (nmea_parse_unsigned(data, &svid))
	    {
		if ((svid >= 1) && (svid <= 96))
		{
		    context->sv_used_mask[(svid -1) >> 5] |= (1ul << ((svid -1) & 31));
		}
	    }
	    else
	    {
		context->sv_used_count = 0;
		context->sv_used_mask[0] = 0;
		context->sv_used_mask[1] = 0;
		context->sv_used_mask[2] = 0;

		sequence_next = NMEA_FIELD_SEQUENCE_SKIP;
	    }
	}
	break;

    case NMEA_FIELD_SEQUENCE_GSA_PDOP:
	if (data[0] == '\0')
	{
	    context->mask &= ~NMEA_FIELD_MASK_PDOP;
	}
	else if (nmea_parse_fixed(data, &pdop, 2))
	{
	    device->location.pdop = pdop;
	}
	else
	{
	    sequence_next = NMEA_FIELD_SEQUENCE_SKIP;
	}
	break;

    case NMEA_FIELD_SEQUENCE_GSA_VDOP:
	if (data[0] == '\0')
	{
	    context->mask &= ~NMEA_FIELD_MASK_VDOP;

	    sequence_next = NMEA_FIELD_SEQUENCE_GSA_END;
	}
	else if (nmea_parse_fixed(data, &vdop, 2))
	{
	    device->location.vdop = vdop;
	    
	    sequence_next = NMEA_FIELD_SEQUENCE_GSA_END;
	}
	else
	{
	    sequence_next = NMEA_FIELD_SEQUENCE_SKIP;
	}
	break;

    case NMEA_FIELD_SEQUENCE_GST_STDDEV_LATITUDE:
	if (data[0] == '\0')
	{
	    context->mask &= ~NMEA_FIELD_MASK_EHPE;
	}
	else if (nmea_parse_fixed(data, &stddev, 3))
	{
	    device->location.ehpe = stddev;
	}
	else
	{
	    sequence_next = NMEA_FIELD_SEQUENCE_SKIP;
	}
	break;

    case NMEA_FIELD_SEQUENCE_GST_STDDEV_LONGITUDE:
	if (data[0] == '\0')
	{
	    context->mask &= ~NMEA_FIELD_MASK_EHPE;
	}
	else if (nmea_parse_fixed(data, &stddev, 3))
	{
	    device->location.ehpe = nmea_isqrt((device->location.ehpe * device->location.ehpe) + (stddev * stddev));
	}
	else
	{
	    sequence_next = NMEA_FIELD_SEQUENCE_SKIP;
	}
	break;

