GrumpyOldPizza/ArduinoCore-stm32l0/libraries/GNSS/src/utility/gnss_core.c
    case NMEA_FIELD_SEQUENCE_GST_STDDEV_ALTITUDE:
	if (data[0] == '\0')
	{
	    context->mask &= ~NMEA_FIELD_MASK_EVPE;

	    sequence_next = NMEA_FIELD_SEQUENCE_GST_END;
	}
	else if (nmea_parse_fixed(data, &stddev, 3))
	{
	    device->location.evpe = stddev;
	    
	    sequence_next = NMEA_FIELD_SEQUENCE_GST_END;
	}
	else
	{
	    sequence_next = NMEA_FIELD_SEQUENCE_SKIP;
	}
	break;

    case NMEA_FIELD_SEQUENCE_GSV_SENTENCES:
	if ((data[0] == '\0') || !nmea_parse_unsigned(data, &sentences))
	{
	    sequence_next = NMEA_FIELD_SEQUENCE_SKIP;
	}
	else
	{
	    if (context->sv_in_view_sentences == 0)
	    {
		context->sv_in_view_sentences = sentences;
		context->sv_in_view_count = 0;
		context->sv_in_view_index = 0;
	    }
	    else
	    {
		if (context->sv_in_view_sentences != sentences)
		{
		    context->sv_in_view_sentences = 0;

		    sequence_next = NMEA_FIELD_SEQUENCE_SKIP;
		}
	    }
	}
	break;

    case NMEA_FIELD_SEQUENCE_GSV_CURRENT:
	if ((data[0] == '\0') || !nmea_parse_unsigned(data, &current))
	{
	    context->sv_in_view_sentences = 0;

	    sequence_next = NMEA_FIELD_SEQUENCE_SKIP;
	}
	else
	{
	    if (context->sv_in_view_index != ((current -1) << 2))
	    {
		context->sv_in_view_sentences = 0;

		sequence_next = NMEA_FIELD_SEQUENCE_SKIP;
	    }
	}
	break;

    case NMEA_FIELD_SEQUENCE_GSV_SV_IN_VIEW_COUNT:
	if ((data[0] == '\0') || !nmea_parse_unsigned(data, &count))
	{
	    context->sv_in_view_sentences = 0;

	    sequence_next = NMEA_FIELD_SEQUENCE_SKIP;
	}
	else
	{
	    context->sv_in_view_count = count;

	    if (count == 0)
	    {
		sequence_next = NMEA_FIELD_SEQUENCE_GSV_END;
	    }
	}
	break;

    case NMEA_FIELD_SEQUENCE_GSV_SV_IN_VIEW_ID:
	svid = 255;

	if ((data[0] == '\0') || nmea_parse_unsigned(data, &svid))
	{
	    if (device->satellites.count < GNSS_SATELLITES_COUNT_MAX)
	    {
		device->satellites.info[device->satellites.count].prn = svid;
		device->satellites.info[device->satellites.count].state = GNSS_SATELLITES_STATE_SEARCHING;
		device->satellites.info[device->satellites.count].snr = 0;
		device->satellites.info[device->satellites.count].elevation = 0;
		device->satellites.info[device->satellites.count].azimuth = 0;
	    }
	}
	else
	{
	    context->sv_in_view_sentences = 0;

	    sequence_next = NMEA_FIELD_SEQUENCE_SKIP;
	}
	break;

    case NMEA_FIELD_SEQUENCE_GSV_SV_IN_VIEW_ELEV:
	elevation = 0;

	if ((data[0] == '\0') || nmea_parse_unsigned(data, &elevation))
	{
	    if (device->satellites.count < GNSS_SATELLITES_COUNT_MAX)
	    {
		device->satellites.info[device->satellites.count].elevation = elevation;
	    }
	}
	else
	{
	    context->sv_in_view_sentences = 0;

	    sequence_next = NMEA_FIELD_SEQUENCE_SKIP;
	}
	break;

    case NMEA_FIELD_SEQUENCE_GSV_SV_IN_VIEW_AZIM:
	azimuth = 0;

	if ((data[0] == '\0') || nmea_parse_unsigned(data, &azimuth))
	{
	    if (device->satellites.count < GNSS_SATELLITES_COUNT_MAX)
	    {
		device->satellites.info[device->satellites.count].azimuth = azimuth;
	    }
	}
	else
	{
	    context->sv_in_view_sentences = 0;

	    sequence_next = NMEA_FIELD_SEQUENCE_SKIP;
	}
	break;

    case NMEA_FIELD_SEQUENCE_GSV_SV_IN_VIEW_SNR:
	if ((data[0] == '\0') || nmea_parse_unsigned(data, &snr))
	{
	    if (device->satellites.count < GNSS_SATELLITES_COUNT_MAX)
	    {
		if (data[0] != '\0')
		{
		    device->satellites.info[device->satellites.count].state = GNSS_SATELLITES_STATE_TRACKING;
		    device->satellites.info[device->satellites.count].snr = snr;
		}
	    }

	    device->satellites.count++;

	    context->sv_in_view_index++;

	    if ((context->sv_in_view_index == context->sv_in_view_count) || !(context->sv_in_view_index & 3))
	    {
		sequence_next = NMEA_FIELD_SEQUENCE_GSV_END;
	    }
	    else
	    {
		sequence_next = NMEA_FIELD_SEQUENCE_GSV_SV_IN_VIEW_ID;
	    }
	}
	else
	{
	    context->sv_in_view_sentences = 0;

	    sequence_next = NMEA_FIELD_SEQUENCE_SKIP;
	}
	break;

    case NMEA_FIELD_SEQUENCE_RMC_STATUS:
	if (data[0] == 'A')
	{
	    context->status = NMEA_STATUS_DATA_VALID;
	}
	else if (data[0] == 'V')
	{
	    context->status = NMEA_STATUS_RECEIVER_WARNING;
	}
	else
	{
	    sequence_next = NMEA_FIELD_SEQUENCE_SKIP;
	}
	break;

    case NMEA_FIELD_SEQUENCE_RMC_SPEED:
	if (data[0] == '\0')
	{
	    context->mask &= ~NMEA_FIELD_MASK_SPEED;
	}
	else if (nmea_parse_fixed(data, &speed, 3))
	{
	    /* Conversion factor from knots to m/s is 1852 / 3600.
	     */
	    device->location.speed  = (speed * 1852 + 1800) / 3600;
	}
	else
	{
	    sequence_next = NMEA_FIELD_SEQUENCE_SKIP;
	}
	break;

    case NMEA_FIELD_SEQUENCE_RMC_COURSE:
	if (data[0] == '\0')
	{
	    context->mask &= ~NMEA_FIELD_MASK_COURSE;
	}
	else if (nmea_parse_fixed(data, &course, 5))
	{
	    device->location.course = course;
	}
	else
	{
	    sequence_next = NMEA_FIELD_SEQUENCE_SKIP;
	}
	break;

    case NMEA_FIELD_SEQUENCE_RMC_DATE:
	if (data[0] == '\0')
	{
	    context->mask &= ~NMEA_FIELD_MASK_TIME;
	}
	else if (nmea_parse_unsigned(data, &date))
	{
	    device->location.time.day   = date / 10000;
	    device->location.time.month = (date - device->location.time.day * 10000) / 100;
	    device->location.time.year  = (date - device->location.time.day * 10000 - device->location.time.month * 100);
	    
	    if (device->location.time.year < 80)
	    {
		device->location.time.year = (2000 + device->location.time.year) - 1980;
	    }
	    else
	    {
		device->location.time.year = (1900 + device->location.time.year) - 1980;
	    }
	}
	else
	{
	    sequence_next = NMEA_FIELD_SEQUENCE_SKIP;
	}
	break;

    case NMEA_FIELD_SEQUENCE_RMC_MODE:
	/* SKIP FIELD */
	sequence_next = NMEA_FIELD_SEQUENCE_RMC_END;
	break;

    case NMEA_FIELD_SEQUENCE_PMTK001_COMMAND:
	if ((data[0] == '\0') || !nmea_parse_unsigned(data, &command))
	{
	    sequence_next = NMEA_FIELD_SEQUENCE_SKIP;
	}
	else
	{
	    context->mtk_command = command;
	}
	break;

    case NMEA_FIELD_SEQUENCE_PMTK001_STATUS:
	if ((data[0] == '\0') || !nmea_parse_unsigned(data, &status))
	{
	    sequence_next = NMEA_FIELD_SEQUENCE_SKIP;
	}
	else
	{
	    context->mtk_status = status;

