GrumpyOldPizza/ArduinoCore-stm32l0/libraries/GNSS/src/utility/gnss_core.c
	    sequence_next = NMEA_FIELD_SEQUENCE_PMTK001_END;
	}
	break;
    }

    context->sequence = sequence_next;
}

static void nmea_end_sentence(gnss_device_t *device)
{
    nmea_context_t *context = &device->nmea;
    uint32_t expected;
    uint32_t n, svid;

    switch (context->sequence) {

    case NMEA_FIELD_SEQUENCE_GGA_END:
      if (context->mask & NMEA_FIELD_MASK_POSITION)
	{
	    device->location.mask |= GNSS_LOCATION_MASK_POSITION;
	}

	if (context->mask & NMEA_FIELD_MASK_ALTITUDE)
	{
	    device->location.mask |= GNSS_LOCATION_MASK_ALTITUDE;
	}

	if (context->mask & NMEA_FIELD_MASK_HDOP)
	{
	    device->location.mask |= GNSS_LOCATION_MASK_HDOP;
	}
	
	device->seen |= NMEA_SENTENCE_MASK_GPGGA;
	device->seen &= ~NMEA_SENTENCE_MASK_SOLUTION;
	break;

    case NMEA_FIELD_SEQUENCE_GSA_END:
	if (context->mask & NMEA_FIELD_MASK_PDOP)
	{
	    device->location.mask |= GNSS_LOCATION_MASK_PDOP;
	}

	if (context->mask & NMEA_FIELD_MASK_VDOP)
	{
	    device->location.mask |= GNSS_LOCATION_MASK_VDOP;
	}

	/* If the talkes is "GN", then it's a composite fix, which will consist out
	 * of GNGSA, GNGSA, GPGSV & GLGSV. Otherwise only a GPGSA & GPGSV is to be
	 * expected.
	 */

	if (context->prefix == 'N')
	{
	    device->expected |= (NMEA_SENTENCE_MASK_GPGSA | NMEA_SENTENCE_MASK_GPGSV | NMEA_SENTENCE_MASK_GLGSA | NMEA_SENTENCE_MASK_GLGSV);
	    
	    if (!(device->seen & NMEA_SENTENCE_MASK_GPGSA))
	    {
		device->seen |= NMEA_SENTENCE_MASK_GPGSA;
	    }
	    else
	    {
		device->seen |= NMEA_SENTENCE_MASK_GLGSA;
		device->seen &= ~NMEA_SENTENCE_MASK_SOLUTION;
	    }
	}
	else if (context->prefix == 'L')
	{
	    device->expected = (device->expected & ~(NMEA_SENTENCE_MASK_GPGSA | NMEA_SENTENCE_MASK_GPGSV)) | (NMEA_SENTENCE_MASK_GLGSA | NMEA_SENTENCE_MASK_GLGSV);

	    device->seen |= NMEA_SENTENCE_MASK_GLGSA;
	    device->seen &= ~NMEA_SENTENCE_MASK_SOLUTION;
	}
	else
	{
	    device->expected = (device->expected & ~(NMEA_SENTENCE_MASK_GLGSA | NMEA_SENTENCE_MASK_GLGSV)) | (NMEA_SENTENCE_MASK_GPGSA | NMEA_SENTENCE_MASK_GPGSV);

	    device->seen |= NMEA_SENTENCE_MASK_GPGSA;
	    device->seen &= ~NMEA_SENTENCE_MASK_SOLUTION;
	}
	break;

    case NMEA_FIELD_SEQUENCE_GST_END:
	device->expected |= NMEA_SENTENCE_MASK_GPGST;

	if (context->mask & NMEA_FIELD_MASK_EHPE)
	{
	    device->location.mask |= GNSS_LOCATION_MASK_EHPE;
	}

	if (context->mask & NMEA_FIELD_MASK_EVPE)
	{
	    device->location.mask |= GNSS_LOCATION_MASK_EVPE;
	}

	device->seen |= NMEA_SENTENCE_MASK_GPGST;
	device->seen &= ~NMEA_SENTENCE_MASK_SOLUTION;
	break;

    case NMEA_FIELD_SEQUENCE_GSV_END:
	if (context->sv_in_view_count == context->sv_in_view_index)
	{
	    context->sv_in_view_sentences = 0;

	    if (context->prefix == 'P')
	    {
		device->seen |= NMEA_SENTENCE_MASK_GPGSV;
	    }

	    if (context->prefix == 'L')
	    {
		device->seen |= NMEA_SENTENCE_MASK_GLGSV;
	    }
	}
	break;

    case NMEA_FIELD_SEQUENCE_RMC_END:
	if (context->mask & NMEA_FIELD_MASK_TIME)
	{
	    device->location.mask |= GNSS_LOCATION_MASK_TIME;
	}

	if (context->mask & NMEA_FIELD_MASK_SPEED)
	{
	    device->location.mask |= GNSS_LOCATION_MASK_SPEED;
	}

	if (context->mask & NMEA_FIELD_MASK_COURSE)
	{
	    device->location.mask |= GNSS_LOCATION_MASK_COURSE;
	}

	device->seen |= NMEA_SENTENCE_MASK_GPRMC;
	device->seen &= ~NMEA_SENTENCE_MASK_SOLUTION;
	break;

    case NMEA_FIELD_SEQUENCE_PMTK001_END:
	if (device->command == context->mtk_command)
	{
	    device->command = ~0l;

	    mtk_configure(device, (context->mtk_status == 3) ? GNSS_RESPONSE_ACK : GNSS_RESPONSE_NACK, context->mtk_command);
	}
	break;

    default:
	break;
    }

    context->sequence = NMEA_FIELD_SEQUENCE_START;

    if (device->init == GNSS_INIT_DONE)
    {
	expected = device->expected & (NMEA_SENTENCE_MASK_GPGGA |
				       NMEA_SENTENCE_MASK_GPGSA |
				       NMEA_SENTENCE_MASK_GPGST |
				       NMEA_SENTENCE_MASK_GPRMC |
				       NMEA_SENTENCE_MASK_GLGSA);
	
	if ((device->seen & expected) == expected)
	{
	    if ((context->status == NMEA_STATUS_DATA_VALID) && (context->navigation != NMEA_NAVIGATION_NONE))
	    {
		device->location.type = (context->navigation == NMEA_NAVIGATION_2D) ? GNSS_LOCATION_TYPE_2D : GNSS_LOCATION_TYPE_3D;
		device->location.numsv = context->sv_used_count;
	    }
	    else
	    {
		device->location.type = GNSS_LOCATION_TYPE_NONE;
		device->location.numsv = 0;

		context->sv_used_count   = 0;
		context->sv_used_mask[0] = 0;
		context->sv_used_mask[1] = 0;
		context->sv_used_mask[2] = 0;
	    }

	    gnss_location(device);
	    
	    device->seen &= ~(NMEA_SENTENCE_MASK_GPGGA |
			      NMEA_SENTENCE_MASK_GPGSA |
			      NMEA_SENTENCE_MASK_GPGST |
			      NMEA_SENTENCE_MASK_GPRMC |
			      NMEA_SENTENCE_MASK_GLGSA);

	    device->seen |= NMEA_SENTENCE_MASK_SOLUTION;
	}
	
	
	expected = device->expected & (NMEA_SENTENCE_MASK_GPGSV | NMEA_SENTENCE_MASK_GLGSV);
	
	if ((device->seen & NMEA_SENTENCE_MASK_SOLUTION) && ((device->seen & expected) == expected))
	{
	    for (n = 0; n < device->satellites.count; n++)
	    {
		svid = device->satellites.info[n].prn;

		if ((svid >= 1) && (svid <= 96) && (context->sv_used_mask[(svid -1) >> 5] & (1ul << ((svid -1) & 31))))
		{
		    device->satellites.info[n].state |= GNSS_SATELLITES_STATE_NAVIGATING;
		}
	    }

	    gnss_satellites(device);
	    
	    device->seen &= ~(NMEA_SENTENCE_MASK_GPGSV | NMEA_SENTENCE_MASK_GLGSV);
	}
    }
}

static const uint8_t * const mtk_init_table_1hz[] = {
    (const uint8_t *)"$PMTK314,0,1,0,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0*28\r\n",
    (const uint8_t *)"$PMTK220,1000*1F\r\n",            /* POS FIX       */
    (const uint8_t *)"$PMTK300,1000,0,0,0,0*1C\r\n",    /* FIX CTL       */
    (const uint8_t *)"$PMTK286,1*23\r\n",               /* AIC           */
    (const uint8_t *)"$PMTK397,0*23\r\n",               /* NAV THRESHOLD */
    NULL,
};

static const uint8_t * const mtk_init_table_5hz[] = {
    (const uint8_t *)"$PMTK314,0,1,0,1,1,5,1,1,0,0,0,0,0,0,0,0,0,0,0*2C\r\n",
    (const uint8_t *)"$PMTK220,200*2C\r\n",             /* POS FIX       */
    (const uint8_t *)"$PMTK300,200,0,0,0,0*2F\r\n",     /* FIX CTL       */
    (const uint8_t *)"$PMTK286,1*23\r\n",               /* AIC           */
    (const uint8_t *)"$PMTK397,0*23\r\n",               /* NAV THRESHOLD */
    NULL,
};

static const uint8_t * const mtk_constellation_gps_glonass_table[] = {
    (const uint8_t *)"$PMTK353,1,1*37\r\n",             /* GLONASS       */
    NULL,
};

static const uint8_t * const mtk_constellation_gps_table[] = {
    (const uint8_t *)"$PMTK353,1,0*36\r\n",             /* GLONASS       */
    NULL,
};

static const uint8_t * const mtk_sbas_enable_table[] = {
    (const uint8_t *)"$PMTK301,2*2E\r\n",               /* DGPS MODE     */
    (const uint8_t *)"$PMTK313,1*2E\r\n",               /* SBAS ENABLED  */
    NULL,
};

