GrumpyOldPizza/ArduinoCore-stm32l0/libraries/GNSS/src/utility/gnss_core.c
static const uint8_t * const mtk_sbas_disable_table[] = {
    (const uint8_t *)"$PMTK301,0*2C\r\n",               /* DGPS MODE     */
    (const uint8_t *)"$PMTK313,0*2F\r\n",               /* SBAS ENABLED  */
    NULL,
};

static const uint8_t * const mtk_qzss_enable_table[] = {
    (const uint8_t *)"$PMTK351,0*29\r\n",               /* QZSS NMEA     */
    (const uint8_t *)"$PMTK352,0*2A\r\n",               /* QZSS STOP     */
    NULL,
};

static const uint8_t * const mtk_qzss_disable_table[] = {
    (const uint8_t *)"$PMTK351,0*29\r\n",               /* QZSS NMEA     */
    (const uint8_t *)"$PMTK352,1*2B\r\n",               /* QZSS STOP     */
    NULL,
};

static void mtk_send(gnss_device_t *device, const uint8_t *data)
{
    device->command = ((data[5] - '0') * 10 + (data[6] - '0')) * 10 + (data[7] - '0');
    device->busy = 1;

    (*device->send_routine)(device->context, data, strlen((const char*)data), gnss_send_callback);
}

static void mtk_table(gnss_device_t *device, const uint8_t * const * table)
{
    const uint8_t *data;

    data = table[0];
    device->table = table + 1;

    mtk_send(device, data);
}

static void mtk_configure(gnss_device_t *device, unsigned int response, uint32_t command)
{
    const uint8_t *data = NULL;

    if (device->table)
    {
	if (device->init == GNSS_INIT_MTK_BAUD_RATE)
	{
	    device->init = GNSS_INIT_MTK_INIT_TABLE;

	    data = device->table[0];
	    device->table = device->table + 1;
	}
	else
	{
	    if (device->table[0] != NULL)
	    {
		data = device->table[0];
		device->table = device->table + 1;
	    }
	    else
	    {
		device->table = NULL;

		if (device->init == GNSS_INIT_MTK_INIT_TABLE)
		{
		    device->init = GNSS_INIT_DONE;
		    device->seen = 0;
		    device->expected = NMEA_SENTENCE_MASK_GPGGA | NMEA_SENTENCE_MASK_GPGSA | NMEA_SENTENCE_MASK_GPGSV | NMEA_SENTENCE_MASK_GPRMC;
		
		    device->location.type = 0;
		    device->location.mask = 0;
		}
	    }
	}
    }

    if (data)
    {
	mtk_send(device, data);
    }
}

/************************************************************************************/

#if 0

static inline int8_t ubx_data_int8(const uint8_t *data, unsigned int offset)
{
    return (int8_t)data[offset];
}

static inline int16_t ubx_data_int16(const uint8_t *data, unsigned int offset)
{
    return (int16_t)(((uint16_t)data[offset+0] << 0) |
		     ((uint16_t)data[offset+1] << 8));
}

static inline int32_t ubx_data_int32(const uint8_t *data, unsigned int offset)
{
    return (int32_t)(((uint32_t)data[offset+0] <<  0) |
		     ((uint32_t)data[offset+1] <<  8) |
		     ((uint32_t)data[offset+2] << 16) |
		     ((uint32_t)data[offset+3] << 24));
}

static inline uint8_t ubx_data_uint8(const uint8_t *data, unsigned int offset)
{
    return (uint8_t)data[offset];
}

static inline uint16_t ubx_data_uint16(const uint8_t *data, unsigned int offset)
{
    return (uint16_t)(((uint16_t)data[offset+0] << 0) |
		      ((uint16_t)data[offset+1] << 8));
}

static inline uint32_t ubx_data_uint32(const uint8_t *data, unsigned int offset)
{
    return (uint32_t)(((uint32_t)data[offset+0] <<  0) |
		      ((uint32_t)data[offset+1] <<  8) |
		      ((uint32_t)data[offset+2] << 16) |
		      ((uint32_t)data[offset+3] << 24));
}

#endif


static inline int8_t ubx_data_int8(const uint8_t *data, unsigned int offset)
{
    return *((const int8_t*)((const void*)(&data[offset])));
}

static inline int16_t ubx_data_int16(const uint8_t *data, unsigned int offset)
{
    return *((const int16_t*)((const void*)(&data[offset])));
}

static inline int32_t ubx_data_int32(const uint8_t *data, unsigned int offset)
{
    return *((const int32_t*)((const void*)(&data[offset])));
}

static inline uint8_t ubx_data_uint8(const uint8_t *data, unsigned int offset)
{
    return *((const uint8_t*)((const void*)(&data[offset])));
}

static inline uint16_t ubx_data_uint16(const uint8_t *data, unsigned int offset)
{
    return *((const uint16_t*)((const void*)(&data[offset])));
}

static inline uint32_t ubx_data_uint32(const uint8_t *data, unsigned int offset)
{
    return *((const uint32_t*)((const void*)(&data[offset])));
}

static void ubx_start_message(gnss_device_t *device, unsigned int message, unsigned int length)
{
    if (message == 0x0130)
    {
	/* UBX-NAV-SVINFO/UBX-NAV-SAT */
	    
	device->rx_chunk = 20;
	device->satellites.count = 0;
	
	device->seen &= ~UBX_MESSAGE_MASK_NAV_SVINFO;
    }
}

static void ubx_parse_message(gnss_device_t *device, unsigned int message, uint8_t *data, unsigned int count)
{
    unsigned int svid;

    if (message == 0x0130)
    {
	/* UBX-NAV-SVINFO */

	svid = ubx_data_uint8(data, 9);

	if ((svid >= 1) && (svid <= 32))
	{
	    /* GPS */
	}
	else if ((svid >= 33) && (svid <= 64))
	{
	    /* BEIDOU */
	    svid += (201 + 5 - 33);
	}
	else if ((svid >= 65) && (svid <= 96))
	{
	    /* GLONASS */
	}
	else if ((svid >= 120) && (svid <= 151))
	{
	    /* SBAS */
	    svid -= 87;
	}
	else if ((svid >= 152) && (svid <= 158))
	{
	    /* SBAS */
	}
	else if ((svid >= 159) && (svid <= 163))
	{
	    /* BEIDOU */
	    svid += (201 - 159);
	}
	else if ((svid >= 193) && (svid <= 200))
	{
	    /* QZSS */
	}
	else if (svid == 255)
	{
	    /* GLONASS */
	}
	else
	{
	    svid = 0;
	}

	if (svid && (device->satellites.count < GNSS_SATELLITES_COUNT_MAX))
	{
	    device->satellites.info[device->satellites.count].prn = svid;

	    if (ubx_data_int8(data, 13) > 0)
	    {
		device->satellites.info[device->satellites.count].elevation = ubx_data_int8(data, 13);
		device->satellites.info[device->satellites.count].azimuth = ubx_data_int16(data, 14);
	    }
	    else
	    {
		device->satellites.info[device->satellites.count].elevation = 0;
		device->satellites.info[device->satellites.count].azimuth = 0;
	    }

	    device->satellites.info[device->satellites.count].snr = ubx_data_uint8(data, 12);

	    switch (ubx_data_uint8(data, 11) & 0x0f) {
	    case 0x00: /* NO SIGNAL */
	    case 0x01: /* SEARCHING */ 
		device->satellites.info[device->satellites.count].state = GNSS_SATELLITES_STATE_SEARCHING;
		break;

