GrumpyOldPizza/ArduinoCore-stm32l0/libraries/GNSS/src/utility/gnss_core.c
	    device->seen |= UBX_MESSAGE_MASK_NAV_TIMEGPS;
	    device->seen &= ~UBX_MESSAGE_MASK_SOLUTION;
	    break;

	case 0x30:
	    /* UBX-NAV-SVINFO */

	    device->seen |= UBX_MESSAGE_MASK_NAV_SVINFO;
	    break;

	default:
	    break;
	}
    }

    else if (message == 0x0500)
    {
	/* UBX-ACK-NACK */
	command = ((ubx_data_uint8(data, 0) << 8) | ubx_data_uint8(data, 1));

	if (command == device->command)
	{
	    device->command = ~0l;
	    
	    ubx_configure(device, GNSS_RESPONSE_NACK, command);
	}
    }

    else if (message == 0x0501)
    {
	/* UBX-ACK-ACK */
	command = ((ubx_data_uint8(data, 0) << 8) | ubx_data_uint8(data, 1));

	if (command == device->command)
	{
	    device->command = ~0l;
	    
	    ubx_configure(device, GNSS_RESPONSE_ACK, command);
	}
    }

    if (device->init == GNSS_INIT_DONE)
    {
	expected = device->expected & (UBX_MESSAGE_MASK_NAV_DOP |
				       UBX_MESSAGE_MASK_NAV_PVT |
				       UBX_MESSAGE_MASK_NAV_TIMEGPS);
	
	if ((device->seen & expected) == expected)
	{
	    if (context->week && device->location.time.year)
	    {
		if (!(device->seen & UBX_MESSAGE_MASK_NAV_TIMEGPS))
		{
		    device->location.correction = utc_offset_time(&device->location.time, context->week, context->tow);
		}

		device->location.mask |= (GNSS_LOCATION_MASK_TIME | GNSS_LOCATION_MASK_CORRECTION);
	    }
	    
	    gnss_location(device);
	    
	    device->seen &= ~(UBX_MESSAGE_MASK_NAV_DOP |
			      UBX_MESSAGE_MASK_NAV_PVT |
			      UBX_MESSAGE_MASK_NAV_TIMEGPS);
	    
	    device->seen |= UBX_MESSAGE_MASK_SOLUTION;
	}
	
	expected = device->expected & UBX_MESSAGE_MASK_NAV_SVINFO;
	
	if ((device->seen & UBX_MESSAGE_MASK_SOLUTION) && ((device->seen & expected) == expected))
	{
	    gnss_satellites(device);
	    
	    device->seen &= ~UBX_MESSAGE_MASK_NAV_SVINFO;
	}
    }
}

static const uint8_t ubx_cfg_msg_nav_pvt[] = {
    0xb5, 0x62,                                     /* SYNC_CHAR_1, SYNC_CHAR_2  */
    0x06, 0x01,                                     /* CLASS, ID                 */
    0x08, 0x00,                                     /* LENGTH                    */
    0x01,                                           /* CLASS                     */
    0x07,                                           /* ID                        */
    0x01,                                           /* RATE DDC                  */
    0x01,                                           /* RATE UART1                */
    0x00,                                           /* RATE UART2                */
    0x00,                                           /* RATE USB                  */
    0x00,                                           /* RATE SPI                  */
    0x00,                                           /*                           */
    0x19, 0xe7,                                     /* CK_A, CK_B                */
};

static const uint8_t ubx_cfg_msg_nav_timegps[] = {
    0xb5, 0x62,                                     /* SYNC_CHAR_1, SYNC_CHAR_2  */
    0x06, 0x01,                                     /* CLASS, ID                 */
    0x08, 0x00,                                     /* LENGTH                    */
    0x01,                                           /* CLASS                     */
    0x20,                                           /* ID                        */
    0x01,                                           /* RATE DDC                  */
    0x01,                                           /* RATE UART1                */
    0x00,                                           /* RATE UART2                */
    0x00,                                           /* RATE USB                  */
    0x00,                                           /* RATE SPI                  */
    0x00,                                           /*                           */
    0x32, 0x96,                                     /* CK_A, CK_B                */
};

static const uint8_t ubx_cfg_msg_nav_dop[] = {
    0xb5, 0x62,                                     /* SYNC_CHAR_1, SYNC_CHAR_2  */
    0x06, 0x01,                                     /* CLASS, ID                 */
    0x08, 0x00,                                     /* LENGTH                    */
    0x01,                                           /* CLASS                     */
    0x04,                                           /* ID                        */
    0x01,                                           /* RATE DDC                  */
    0x01,                                           /* RATE UART1                */
    0x00,                                           /* RATE UART2                */
    0x00,                                           /* RATE USB                  */
    0x00,                                           /* RATE SPI                  */
    0x00,                                           /*                           */
    0x16, 0xd2,                                     /* CK_A, CK_B                */
};

static const uint8_t ubx_cfg_msg_nav_svinfo_1hz[] = {
    0xb5, 0x62,                                     /* SYNC_CHAR_1, SYNC_CHAR_2  */
    0x06, 0x01,                                     /* CLASS, ID                 */
    0x08, 0x00,                                     /* LENGTH                    */
    0x01,                                           /* CLASS                     */
    0x30,                                           /* ID                        */
    0x01,                                           /* RATE DDC                  */
    0x01,                                           /* RATE UART1                */
    0x00,                                           /* RATE UART2                */
    0x00,                                           /* RATE USB                  */
    0x00,                                           /* RATE SPI                  */
    0x00,                                           /*                           */
    0x42, 0x06,                                     /* CK_A, CK_B                */
};

static const uint8_t ubx_cfg_msg_nav_svinfo_5hz[] = {
    0xb5, 0x62,                                     /* SYNC_CHAR_1, SYNC_CHAR_2  */
    0x06, 0x01,                                     /* CLASS, ID                 */
    0x08, 0x00,                                     /* LENGTH                    */
    0x01,                                           /* CLASS                     */
    0x30,                                           /* ID                        */
    0x05,                                           /* RATE DDC                  */
    0x05,                                           /* RATE UART1                */
    0x00,                                           /* RATE UART2                */
    0x00,                                           /* RATE USB                  */
    0x00,                                           /* RATE SPI                  */
    0x00,                                           /*                           */
    0x4a, 0x32,                                     /* CK_A, CK_B                */
};

static const uint8_t ubx_cfg_msg_nav_svinfo_10hz[] = {
    0xb5, 0x62,                                     /* SYNC_CHAR_1, SYNC_CHAR_2  */
    0x06, 0x01,                                     /* CLASS, ID                 */
    0x08, 0x00,                                     /* LENGTH                    */
    0x01,                                           /* CLASS                     */
    0x30,                                           /* ID                        */
    0x0a,                                           /* RATE DDC                  */
    0x0a,                                           /* RATE UART1                */
    0x00,                                           /* RATE UART2                */
    0x00,                                           /* RATE USB                  */
    0x00,                                           /* RATE SPI                  */
    0x00,                                           /*                           */
    0x54, 0x69,                                     /* CK_A, CK_B                */
};

static const uint8_t ubx_cfg_msg_nmea_gga[] = {
    0xb5, 0x62,                                     /* SYNC_CHAR_1, SYNC_CHAR_2  */
    0x06, 0x01,                                     /* CLASS, ID                 */
    0x08, 0x00,                                     /* LENGTH                    */
    0xf0,                                           /* CLASS                     */
    0x00,                                           /* ID                        */
    0x00,                                           /* RATE DDC                  */
    0x00,                                           /* RATE UART1                */
    0x00,                                           /* RATE UART2                */
    0x00,                                           /* RATE USB                  */
    0x00,                                           /* RATE SPI                  */
    0x00,                                           /*                           */
    0xff, 0x23,                                     /* CK_A, CK_B                */
};

static const uint8_t ubx_cfg_msg_nmea_gll[] = {
    0xb5, 0x62,                                     /* SYNC_CHAR_1, SYNC_CHAR_2  */
    0x06, 0x01,                                     /* CLASS, ID                 */
    0x08, 0x00,                                     /* LENGTH                    */
    0xf0,                                           /* CLASS                     */
    0x01,                                           /* ID                        */
    0x00,                                           /* RATE DDC                  */
    0x00,                                           /* RATE UART1                */
    0x00,                                           /* RATE UART2                */
    0x00,                                           /* RATE USB                  */
    0x00,                                           /* RATE SPI                  */
    0x00,                                           /*                           */
    0x00, 0x2a,                                     /* CK_A, CK_B                */
};

static const uint8_t ubx_cfg_msg_nmea_gsa[] = {
    0xb5, 0x62,                                     /* SYNC_CHAR_1, SYNC_CHAR_2  */
    0x06, 0x01,                                     /* CLASS, ID                 */
    0x08, 0x00,                                     /* LENGTH                    */
    0xf0,                                           /* CLASS                     */
    0x02,                                           /* ID                        */
    0x00,                                           /* RATE DDC                  */
    0x00,                                           /* RATE UART1                */
    0x00,                                           /* RATE UART2                */
    0x00,                                           /* RATE USB                  */
    0x00,                                           /* RATE SPI                  */
    0x00,                                           /*                           */
    0x01, 0x31,                                     /* CK_A, CK_B                */
};

static const uint8_t ubx_cfg_msg_nmea_gsv[] = {
    0xb5, 0x62,                                     /* SYNC_CHAR_1, SYNC_CHAR_2  */
    0x06, 0x01,                                     /* CLASS, ID                 */
    0x08, 0x00,                                     /* LENGTH                    */
    0xf0,                                           /* CLASS                     */
    0x03,                                           /* ID                        */
    0x00,                                           /* RATE DDC                  */
    0x00,                                           /* RATE UART1                */
    0x00,                                           /* RATE UART2                */
    0x00,                                           /* RATE USB                  */
    0x00,                                           /* RATE SPI                  */
    0x00,                                           /*                           */
    0x02, 0x38,                                     /* CK_A, CK_B                */
};

