GrumpyOldPizza/ArduinoCore-stm32l0/libraries/GNSS/src/utility/gnss_core.c
static const uint8_t ubx_cfg_gnss_gps_enable[] = {
    0xb5, 0x62,                                     /* SYNC_CHAR_1, SYNC_CHAR_2  */
    0x06, 0x3e,                                     /* CLASS, ID                 */
    0x0c, 0x00,                                     /* LENGTH                    */
    0x00,                                           /* VERSION                   */
    0x00,                                           /* NUM TRACKING CHANNELS HW  */
    0xff,                                           /* NUM TRACKING CHANNELS SW  */
    0x01,                                           /* NUM CONFIG BLOCKS         */
    0x00, 0x08, 0x10, 0x00, 0x01, 0x00, 0x01, 0x00, /* GPS                       */
    0x6a, 0x47,                                     /* CK_A, CK_B                */
};

static const uint8_t ubx_cfg_gnss_gps_disable[] = {
    0xb5, 0x62,                                     /* SYNC_CHAR_1, SYNC_CHAR_2  */
    0x06, 0x3e,                                     /* CLASS, ID                 */
    0x0c, 0x00,                                     /* LENGTH                    */
    0x00,                                           /* VERSION                   */
    0x00,                                           /* NUM TRACKING CHANNELS HW  */
    0xff,                                           /* NUM TRACKING CHANNELS SW  */
    0x01,                                           /* NUM CONFIG BLOCKS         */
    0x00, 0x08, 0x10, 0x00, 0x00, 0x00, 0x00, 0x00, /* GPS                       */
    0x68, 0x41,                                     /* CK_A, CK_B                */
};

static const uint8_t ubx_cfg_gnss_sbas_enable[] = {
    0xb5, 0x62,                                     /* SYNC_CHAR_1, SYNC_CHAR_2  */
    0x06, 0x3e,                                     /* CLASS, ID                 */
    0x0c, 0x00,                                     /* LENGTH                    */
    0x00,                                           /* VERSION                   */
    0x00,                                           /* NUM TRACKING CHANNELS HW  */
    0xff,                                           /* NUM TRACKING CHANNELS SW  */
    0x01,                                           /* NUM CONFIG BLOCKS         */
    0x01, 0x01, 0x03, 0x00, 0x01, 0x00, 0x01, 0x00, /* SBAS                      */
    0x57, 0xd0,                                     /* CK_A, CK_B                */
};

static const uint8_t ubx_cfg_gnss_sbas_disable[] = {
    0xb5, 0x62,                                     /* SYNC_CHAR_1, SYNC_CHAR_2  */
    0x06, 0x3e,                                     /* CLASS, ID                 */
    0x0c, 0x00,                                     /* LENGTH                    */
    0x00,                                           /* VERSION                   */
    0x00,                                           /* NUM TRACKING CHANNELS HW  */
    0xff,                                           /* NUM TRACKING CHANNELS SW  */
    0x01,                                           /* NUM CONFIG BLOCKS         */
    0x01, 0x01, 0x03, 0x00, 0x00, 0x00, 0x00, 0x00, /* SBAS                      */
    0x55, 0xca,                                     /* CK_A, CK_B                */
};

static const uint8_t ubx_cfg_gnss_qzss_enable[] = {
    0xb5, 0x62,                                     /* SYNC_CHAR_1, SYNC_CHAR_2  */
    0x06, 0x3e,                                     /* CLASS, ID                 */
    0x0c, 0x00,                                     /* LENGTH                    */
    0x00,                                           /* VERSION                   */
    0x00,                                           /* NUM TRACKING CHANNELS HW  */
    0xff,                                           /* NUM TRACKING CHANNELS SW  */
    0x01,                                           /* NUM CONFIG BLOCKS         */
    0x05, 0x00, 0x03, 0x00, 0x01, 0x00, 0x01, 0x00, /* QZSS                      */
    0x5a, 0xe9,                                     /* CK_A, CK_B                */
};

static const uint8_t ubx_cfg_gnss_qzss_disable[] = {
    0xb5, 0x62,                                     /* SYNC_CHAR_1, SYNC_CHAR_2  */
    0x06, 0x3e,                                     /* CLASS, ID                 */
    0x0c, 0x00,                                     /* LENGTH                    */
    0x00,                                           /* VERSION                   */
    0x00,                                           /* NUM TRACKING CHANNELS HW  */
    0xff,                                           /* NUM TRACKING CHANNELS SW  */
    0x01,                                           /* NUM CONFIG BLOCKS         */
    0x05, 0x00, 0x03, 0x00, 0x00, 0x00, 0x00, 0x00, /* QZSS                      */
    0x58, 0xe3,                                     /* CK_A, CK_B                */
};

static const uint8_t ubx_cfg_gnss_glonass_enable[] = {
    0xb5, 0x62,                                     /* SYNC_CHAR_1, SYNC_CHAR_2  */
    0x06, 0x3e,                                     /* CLASS, ID                 */
    0x0c, 0x00,                                     /* LENGTH                    */
    0x00,                                           /* VERSION                   */
    0x00,                                           /* NUM TRACKING CHANNELS HW  */
    0xff,                                           /* NUM TRACKING CHANNELS SW  */
    0x01,                                           /* NUM CONFIG BLOCKS         */
    0x06, 0x08, 0x0e, 0x00, 0x01, 0x00, 0x01, 0x00, /* GLONASS                   */
    0x6e, 0x6b,                                     /* CK_A, CK_B                */
};

static const uint8_t ubx_cfg_gnss_glonass_disable[] = {
    0xb5, 0x62,                                     /* SYNC_CHAR_1, SYNC_CHAR_2  */
    0x06, 0x3e,                                     /* CLASS, ID                 */
    0x0c, 0x00,                                     /* LENGTH                    */
    0x00,                                           /* VERSION                   */
    0x00,                                           /* NUM TRACKING CHANNELS HW  */
    0xff,                                           /* NUM TRACKING CHANNELS SW  */
    0x01,                                           /* NUM CONFIG BLOCKS         */
    0x06, 0x08, 0x0e, 0x00, 0x00, 0x00, 0x00, 0x00, /* GLONASS                   */
    0x6c, 0x65,                                     /* CK_A, CK_B                */
};

static const uint8_t ubx_cfg_sbas_disable[] = {
    0xb5, 0x62,                                     /* SYNC_CHAR_1, SYNC_CHAR_2  */
    0x06, 0x16,                                     /* CLASS, ID                 */
    0x08, 0x00,                                     /* LENGTH                    */
    0x00,                                           /* MODE                      */
    0x00,                                           /* USAGE                     */
    0x00,                                           /* MAX SBAS                  */
    0x00,                                           /* SCANMODE2                 */
    0x00, 0x00, 0x00, 0x00,                         /* SCANMODE1 (133, 135, 138) */
    0x24, 0x8a,                                     /* CK_A, CK_B                */
};

