GrumpyOldPizza/ArduinoCore-stm32l0/libraries/GNSS/src/utility/gnss_core.c
static const uint8_t ubx_cfg_sbas_auto[] = {
    0xb5, 0x62,                                     /* SYNC_CHAR_1, SYNC_CHAR_2  */
    0x06, 0x16,                                     /* CLASS, ID                 */
    0x08, 0x00,                                     /* LENGTH                    */
    0x01,                                           /* MODE                      */
    0x03,                                           /* USAGE                     */
    0x03,                                           /* MAX SBAS                  */
    0x00,                                           /* SCANMODE2                 */
    0x89, 0xa3, 0x07, 0x00,                         /* SCANMODE1                 */
    0x5e, 0xd4,                                     /* CK_A, CK_B                */
};

static const uint8_t ubx_cfg_rxm_continuous[] = {
    0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 
    0xb5, 0x62,                                     /* SYNC_CHAR_1, SYNC_CHAR_2  */
    0x06, 0x11,                                     /* CLASS, ID                 */
    0x02, 0x00,                                     /* LENGTH                    */
    0x00,                                           /* RESERVED                  */
    0x00,                                           /* MODE                      */
    0x19, 0x81,                                     /* CK_A, CK_B                */
};

static const uint8_t ubx_cfg_rxm_powersave[] = {
    0xb5, 0x62,                                     /* SYNC_CHAR_1, SYNC_CHAR_2  */
    0x06, 0x11,                                     /* CLASS, ID                 */
    0x02, 0x00,                                     /* LENGTH                    */
    0x00,                                           /* RESERVED                  */
    0x01,                                           /* MODE                      */
    0x1a, 0x82,                                     /* CK_A, CK_B                */
};

static const uint8_t ubx_cfg_save[] = {
    0xb5, 0x62,                                     /* SYNC_CHAR_1, SYNC_CHAR_2  */
    0x06, 0x09,                                     /* CLASS, ID                 */
    0x0d, 0x00,                                     /* LENGTH                    */
    0x00, 0x00, 0x00, 0x00,                         /* CLEAR MASK                */
    0xff, 0xff, 0xff, 0xff,                         /* SAVE MASK                 */
    0x00, 0x00, 0x00, 0x00,                         /* LOAD MASK                 */
    0x01,                                           /* DEVICE MASK               */
    0x19, 0x9c,                                     /* CK_A, CK_B                */
};

static const uint8_t ubx_rxm_pmreq[] = {
    0xb5, 0x62,                                     /* SYNC_CHAR_1, SYNC_CHAR_2  */
    0x02, 0x41,                                     /* CLASS, ID                 */
    0x08, 0x00,                                     /* LENGTH                    */
    0x00, 0x00, 0x00, 0x00,                         /* DURATION                  */
    0x02, 0x00, 0x00, 0x00,                         /* FLAGS                     */
    0x4d, 0x3b,                                     /* CK_A, CK_B                */
};

static const uint8_t ubx_cfg_external_enable[] = {
    0xb5, 0x62,                                     /* SYNC_CHAR_1, SYNC_CHAR_2  */
    0x06, 0x13,                                     /* CLASS, ID                 */
    0x04, 0x00,                                     /* LENGTH                    */
    0x00, 0x00,                                     /* FLAGS                     */
    0xf0, 0xb9,                                     /* PINS                      */
    0xc6, 0x66,                                     /* CK_A, CK_B                */
};

static const uint8_t ubx_cfg_external_disable[] = {
    0xb5, 0x62,                                     /* SYNC_CHAR_1, SYNC_CHAR_2  */
    0x06, 0x13,                                     /* CLASS, ID                 */
    0x04, 0x00,                                     /* LENGTH                    */
    0x01, 0x00,                                     /* FLAGS                     */
    0xf0, 0xb9,                                     /* PINS                      */
    0xc7, 0x6a,                                     /* CK_A, CK_B                */
};

static const uint8_t * const ubx_init_table_1hz[] = {
    ubx_cfg_rxm_continuous,
    ubx_cfg_pm2,
    ubx_cfg_msg_nav_pvt,
    ubx_cfg_msg_nav_timegps,
    ubx_cfg_msg_nav_dop,
    ubx_cfg_msg_nav_svinfo_1hz,
    ubx_cfg_msg_nmea_gga,
    ubx_cfg_msg_nmea_gll,
    ubx_cfg_msg_nmea_gsa,
    ubx_cfg_msg_nmea_gsv,
    ubx_cfg_msg_nmea_rmc,
    ubx_cfg_msg_nmea_vtg,
    ubx_cfg_rate_1hz,
    ubx_cfg_tp5,
    ubx_cfg_gnss_glonass_enable,
    ubx_cfg_gnss_sbas_enable,
    ubx_cfg_gnss_qzss_disable,
    ubx_cfg_sbas_auto,
    ubx_cfg_save,
    NULL,
};

static const uint8_t * const ubx_init_table_5hz[] = {
    ubx_cfg_rxm_continuous,
    ubx_cfg_pm2,
    ubx_cfg_msg_nav_pvt,
    ubx_cfg_msg_nav_timegps,
    ubx_cfg_msg_nav_dop,
    ubx_cfg_msg_nav_svinfo_5hz,
    ubx_cfg_msg_nmea_gga,
    ubx_cfg_msg_nmea_gll,
    ubx_cfg_msg_nmea_gsa,
    ubx_cfg_msg_nmea_gsv,
    ubx_cfg_msg_nmea_rmc,
    ubx_cfg_msg_nmea_vtg,
    ubx_cfg_rate_5hz,
    ubx_cfg_tp5,
    ubx_cfg_gnss_glonass_enable,
    ubx_cfg_gnss_sbas_enable,
    ubx_cfg_gnss_qzss_disable,
    ubx_cfg_sbas_auto,
    ubx_cfg_save,
    NULL,
};

static const uint8_t * const ubx_init_table_10hz[] = {
    ubx_cfg_rxm_continuous,
    ubx_cfg_pm2,
    ubx_cfg_msg_nav_pvt,
    ubx_cfg_msg_nav_timegps,
    ubx_cfg_msg_nav_dop,
    ubx_cfg_msg_nav_svinfo_10hz,
    ubx_cfg_msg_nmea_gga,
    ubx_cfg_msg_nmea_gll,
    ubx_cfg_msg_nmea_gsa,
    ubx_cfg_msg_nmea_gsv,
    ubx_cfg_msg_nmea_rmc,
    ubx_cfg_msg_nmea_vtg,
    ubx_cfg_rate_10hz,
    ubx_cfg_tp5,
    ubx_cfg_gnss_glonass_enable,
    ubx_cfg_gnss_sbas_enable,
    ubx_cfg_gnss_qzss_disable,
    ubx_cfg_sbas_auto,
    ubx_cfg_save,
    NULL,
};

static const uint8_t * const ubx_external_enable_table[] = {
    ubx_cfg_rxm_continuous,
    ubx_cfg_pm2,
    ubx_cfg_external_enable,
    ubx_cfg_save,
    NULL,
};

static const uint8_t * const ubx_external_disable_table[] = {
    ubx_cfg_rxm_continuous,
    ubx_cfg_pm2,
    ubx_cfg_external_disable,
    ubx_cfg_save,
    NULL,
};

static const uint8_t * const ubx_constellation_gps_table[] = {
    ubx_cfg_rxm_continuous,
    ubx_cfg_pm2,
    ubx_cfg_gnss_glonass_disable,
    ubx_cfg_save,
    NULL,
};

static const uint8_t * const ubx_constellation_gps_glonass_table[] = {
    ubx_cfg_rxm_continuous,
    ubx_cfg_pm2,
    ubx_cfg_gnss_glonass_enable,
    ubx_cfg_save,
    NULL,
};

static const uint8_t * const ubx_sbas_enable_table[] = {
    ubx_cfg_rxm_continuous,
    ubx_cfg_pm2,
    ubx_cfg_gnss_sbas_enable,
    ubx_cfg_sbas_auto,
    ubx_cfg_save,
    NULL,
};

static const uint8_t * const ubx_sbas_disable_table[] = {
    ubx_cfg_rxm_continuous,
    ubx_cfg_pm2,
    ubx_cfg_gnss_sbas_disable,
    ubx_cfg_sbas_disable,
    ubx_cfg_save,
    NULL,
};

