GrumpyOldPizza/ArduinoCore-stm32l0/libraries/GNSS/src/utility/gnss_core.c
static const uint8_t * const ubx_qzss_enable_table[] = {
    ubx_cfg_rxm_continuous,
    ubx_cfg_pm2,
    ubx_cfg_gnss_qzss_enable,
    ubx_cfg_save,
    NULL,
};

static const uint8_t * const ubx_qzss_disable_table[] = {
    ubx_cfg_rxm_continuous,
    ubx_cfg_pm2,
    ubx_cfg_gnss_qzss_disable,
    ubx_cfg_save,
    NULL,
};

static const uint8_t * const ubx_wakeup_table[] = {
    ubx_cfg_rxm_continuous,
    NULL,
};


static void ubx_checksum(gnss_device_t *device, uint8_t *data)
{
    uint8_t ck_a, ck_b;
    unsigned int i, count;

    count = (data[4] | (data[5] << 8)) + 8;

    ck_a = 0;
    ck_b = 0;
    
    for (i = 2; i < (count -2); i++)
    {
	ck_a += data[i];
	ck_b += ck_a;
    }
	
    data[count -2] = ck_a;
    data[count -1] = ck_b;
}

static void ubx_send(gnss_device_t *device, const uint8_t *data)
{
    uint32_t command;
    unsigned int count;

    if (data == ubx_cfg_rxm_continuous)
    {
	command = 0x0611;
	count   = sizeof(ubx_cfg_rxm_continuous);
    }
    else
    {
	command = (data[2] << 8) | data[3];
	count  = (data[4] | (data[5] << 8)) + 8;
    }

    device->command = command;
    device->busy = 1;

    (*device->send_routine)(device->context, data, count, gnss_send_callback);
}

static void ubx_table(gnss_device_t *device, const uint8_t * const * table)
{
    const uint8_t *data;

    data = table[0];
    device->table = table + 1;

    ubx_send(device, data);
}

static void ubx_configure(gnss_device_t *device, unsigned int response, uint32_t command)
{
    const uint8_t *data = NULL;

    stm32l0_rtc_timer_stop(&device->ubx.timeout);

    if (device->table)
    {
	if (device->init == GNSS_INIT_UBX_BAUD_RATE)
	{
	    device->init = GNSS_INIT_UBX_INIT_TABLE;

	    data = device->table[0];
	    device->table = device->table + 1;
	}
	else
	{
	    if (device->table[0] != NULL)
	    {
		data = device->table[0];
		device->table = device->table + 1;
	    }
	    else
	    {
		device->table = NULL;

		if (device->init == GNSS_INIT_UBX_INIT_TABLE)
		{
		    device->init = GNSS_INIT_DONE;

		    device->expected = (UBX_MESSAGE_MASK_NAV_DOP |
					UBX_MESSAGE_MASK_NAV_PVT |
					UBX_MESSAGE_MASK_NAV_SVINFO |
					UBX_MESSAGE_MASK_NAV_TIMEGPS);
		
		    device->seen = 0;
		    device->location.type = 0;
		    device->location.mask = 0;
		}
	    }
	}
    }

    if (data)
    {
	ubx_send(device, data);

	stm32l0_rtc_timer_start(&device->ubx.timeout, 0, 8192, false); // 250ms

    }
}

static void ubx_timeout(gnss_device_t *device)
{
    const uint8_t *data = NULL;

    if (device->table)
    {
	data = *(device->table -1);

	ubx_send(device, data);

	stm32l0_rtc_timer_start(&device->ubx.timeout, 0, 8192, false); // 250ms
    }
}

/************************************************************************************/

static void gnss_send_callback(void)
{
    gnss_device_t *device = &gnss_device;

    device->busy = 0;
}

void gnss_receive(const uint8_t *data, uint32_t count)
{
    gnss_device_t *device = &gnss_device;
    uint8_t c;

    while (count > 0)
    {
	count--;

	c = *data++;

	if ((device->state <= GNSS_STATE_NMEA_END_LF) && (c == '$'))
	{
	    /* Whenever we see a '$', it's the start of a new sentence,
	     * which can discard a partially read one.
	     */
	    
	    device->state = GNSS_STATE_NMEA_PAYLOAD;
	    device->checksum = 0x00;
	    device->rx_count = 0;

	    nmea_start_sentence(device);
	}
	else
	{
	    switch (device->state) {
	    case GNSS_STATE_START:
		if ((device->mode == GNSS_MODE_UBLOX) && (c == 0xb5))
		{
		    device->state = GNSS_STATE_UBX_SYNC_2;
		}
		break;

	    case GNSS_STATE_NMEA_PAYLOAD:
		if (c == '*')
		{
		    device->rx_data[device->rx_count] = '\0';

		    nmea_parse_sentence(device, &device->rx_data[0], device->rx_count);

		    device->state = GNSS_STATE_NMEA_CHECKSUM_1;
		}
		else if ((c >= 0x20) && (c <= 0x7f))
		{
		    if (device->rx_count >= GNSS_RX_DATA_SIZE)
		    {
			/* Reject a too long sentence.
			 */
			device->state = GNSS_STATE_START;
		    }
		    else
		    {
			device->checksum ^= c;

			if (c == ',')
			{
			    device->rx_data[device->rx_count] = '\0';
			    
			    nmea_parse_sentence(device, &device->rx_data[0], device->rx_count);

			    device->rx_count = 0;
			}
			else
			{
			    device->rx_data[device->rx_count++] = c;
			}
		    }
		}
		else
		{
		    /* If there is an illegal char, then scan again for a new start.
		     */
		    device->state = GNSS_STATE_START;
		}
		break;

	    case GNSS_STATE_NMEA_CHECKSUM_1:
		if (c == nmea_hex_ascii[device->checksum >> 4])
		{
		    device->state = GNSS_STATE_NMEA_CHECKSUM_2;
		}
		else
		{
		    /* If there is a checksum error, then scan again for a new start.
		     */

		    device->state = GNSS_STATE_START;
		}
		break;

	    case GNSS_STATE_NMEA_CHECKSUM_2:
		if (c == nmea_hex_ascii[device->checksum & 0x0f])
		{
		    device->state = GNSS_STATE_NMEA_END_CR;
		}
		else
		{
		    /* If there is a checksum error, then scan again for a new start.
		     */

		    device->state = GNSS_STATE_START;
		}
		break;

	    case GNSS_STATE_NMEA_END_CR:
		if (c == '\r')
		{
		    device->state = GNSS_STATE_NMEA_END_LF;
		}
		else
		{
		    /* If there is an illegal char, then scan again for a new start.
		     */

		    device->state = GNSS_STATE_START;
		}
		break;

	    case GNSS_STATE_NMEA_END_LF:
		if (c == '\n')
		{
		    if (device->init != GNSS_INIT_DONE)
		    {
			if (device->init == GNSS_INIT_MTK_BAUD_RATE)
			{
			    mtk_configure(device, GNSS_RESPONSE_NMEA_SENTENCE, ~0l);
			}

			if (device->init == GNSS_INIT_UBX_BAUD_RATE)
			{
			    ubx_configure(device, GNSS_RESPONSE_NMEA_SENTENCE, ~0l);
			}
		    }

		    nmea_end_sentence(device);
		}
		 
		device->state = GNSS_STATE_START;
		break;

	    case GNSS_STATE_UBX_SYNC_2:
		if (c != 0x62)
		{
		    device->state = GNSS_STATE_START;
		}		
		else
		{
		    device->state = GNSS_STATE_UBX_MESSAGE_1;
		}
		break;
		
	    case GNSS_STATE_UBX_MESSAGE_1:
		device->ubx.ck_a = c;
		device->ubx.ck_b = c;
		device->ubx.message = (c << 8);
		device->state = GNSS_STATE_UBX_MESSAGE_2;
		break;
		
