GrumpyOldPizza/ArduinoCore-stm32l0/libraries/GNSS/src/utility/gnss_core.c
	    case GNSS_STATE_UBX_MESSAGE_2:
		device->ubx.ck_a += c;
		device->ubx.ck_b += device->ubx.ck_a;
		device->ubx.message |= c;
		device->state = GNSS_STATE_UBX_LENGTH_1;
		break;

	    case GNSS_STATE_UBX_LENGTH_1:
		device->ubx.ck_a += c;
		device->ubx.ck_b += device->ubx.ck_a;
		device->ubx.length = c;
		device->state = GNSS_STATE_UBX_LENGTH_2;
		break;
		
	    case GNSS_STATE_UBX_LENGTH_2:
		device->ubx.ck_a += c;
		device->ubx.ck_b += device->ubx.ck_a;
		device->rx_count = 0;
		device->rx_offset = 0;
		device->rx_chunk = ~0l;
		device->ubx.length |= (c << 8);

		ubx_start_message(device, device->ubx.message, device->ubx.length);

		if (device->rx_count == device->ubx.length)
		{
		    device->state = GNSS_STATE_UBX_CK_A;
		}
		else
		{
		    device->state = GNSS_STATE_UBX_PAYLOAD;
		}
		break;
	    
	    case GNSS_STATE_UBX_PAYLOAD:
		device->ubx.ck_a += c;
		device->ubx.ck_b += device->ubx.ck_a;

		if ((device->rx_count - device->rx_offset) < GNSS_RX_DATA_SIZE)
		{
		    device->rx_data[device->rx_count - device->rx_offset] = c;
		}
		
		device->rx_count++;
		
		if (device->rx_count == device->rx_chunk)
		{
		    ubx_parse_message(device, device->ubx.message, &device->rx_data[0], device->rx_count);
		}

		if (device->rx_count == device->ubx.length)
		{
		    device->state = GNSS_STATE_UBX_CK_A;
		}
		break;

	    case GNSS_STATE_UBX_CK_A:
		device->ubx.ck_a ^= c;
		device->state = GNSS_STATE_UBX_CK_B;
		break;
		
	    case GNSS_STATE_UBX_CK_B:
		device->ubx.ck_b ^= c;

		if ((device->ubx.ck_a == 0x00) &&  (device->ubx.ck_b == 0x00))
		{
		    if (device->init != GNSS_INIT_DONE)
		    {
			if (device->init == GNSS_INIT_UBX_BAUD_RATE)
			{
			    ubx_configure(device, GNSS_RESPONSE_UBX_MESSAGE, ~0l);
			}
		    }

		    if ((device->rx_count - device->rx_offset) <= GNSS_RX_DATA_SIZE)
		    {
			ubx_end_message(device, device->ubx.message, &device->rx_data[0], device->rx_count);
		    }
		}

		device->state = GNSS_STATE_START;
		break;

	    default:
		break;
	    }
	}
    }
}

void gnss_initialize(unsigned int mode, unsigned int rate, unsigned int speed, gnss_send_routine_t send_routine, gnss_location_callback_t location_callback, gnss_satellites_callback_t satellites_callback, void *context)
{
    gnss_device_t *device = &gnss_device;
    const char *uart_data = NULL;
    unsigned int uart_count = 0;

    device->send_routine = send_routine;
    device->location_callback = location_callback;
    device->satellites_callback = satellites_callback;
    device->context = context;

    device->state = GNSS_STATE_START;
    device->command = -1;
    device->busy = 0;

    memset(&device->location, 0, sizeof(device->location));
    memset(&device->satellites, 0, sizeof(device->satellites));

    if (mode == GNSS_MODE_UBLOX)
    {
	device->mode = mode;
	device->init = GNSS_INIT_UBX_BAUD_RATE;

	if (rate >= 10)
	{
	    device->table = ubx_init_table_10hz;
	}
	else if (rate >= 5)
	{
	    device->table = ubx_init_table_5hz;
	}
	else
	{
	    device->table = ubx_init_table_1hz;
	}

	if (speed >= 115200)
	{
	    uart_data = "$PUBX,41,1,0007,0003,115200,0*18\r\n";
	}
	else if (speed >= 57600)
	{
	    uart_data = "$PUBX,41,1,0007,0003,57600,0*2B\r\n";
	}
	else if (speed >= 38400)
	{
	    uart_data = "$PUBX,41,1,0007,0003,38400,0*20\r\n";
	}
	else if (speed >= 19200)
	{
	    uart_data = "$PUBX,41,1,0007,0003,19200,0*25\r\n";
	}
	else
	{
	    uart_data = "$PUBX,41,1,0007,0003,9600,0*10\r\n";
	}
	
	uart_count = strlen(uart_data);

	stm32l0_rtc_timer_create(&device->ubx.timeout, (stm32l0_rtc_callback_t)&ubx_timeout, device);
    }
    else
    {
	if (mode == GNSS_MODE_MEDIATEK)
	{
	    device->mode = mode;
	    device->init = GNSS_INIT_MTK_BAUD_RATE;

	    if (rate >= 5)
	    {
		device->table = mtk_init_table_5hz;
	    }
	    else
	    {
		device->table = mtk_init_table_1hz;
	    }
	
	    if (speed >= 115200)
	    {
		uart_data = "$PMTK251,115200*1F\r\n";
	    }
	    else if (speed >= 57600)
	    {
		uart_data = "$PMTK251,57600*2C\r\n";
	    }
	    else if (speed >= 38400)
	    {
		uart_data = "$PMTK251,38400*27\r\n";
	    }
	    else if (speed >= 19200)
	    {
		uart_data = "$PMTK251,19200*22\r\n";
	    }
	    else
	    {
		uart_data = "$PMTK251,9600*17\r\n";
	    }

	    uart_count = strlen(uart_data);
	}
	else
	{
	    device->mode = GNSS_MODE_NMEA;
	    device->init = GNSS_INIT_DONE;
	    device->table = NULL;
	    device->expected = NMEA_SENTENCE_MASK_GPGGA | NMEA_SENTENCE_MASK_GPGSA | NMEA_SENTENCE_MASK_GPGSV | NMEA_SENTENCE_MASK_GPRMC;
	}
    }

    if (uart_data)
    {
	(device->send_routine)(device->context, (const uint8_t*)uart_data, uart_count, NULL);
    }
}

bool gnss_set_external(bool on)
{
    gnss_device_t *device = &gnss_device;

    if (!gnss_done())
    {
	return false;
    }

    switch (device->mode) {
    case GNSS_MODE_NMEA:
	break;
    case GNSS_MODE_MEDIATEK:
	break;
    case GNSS_MODE_UBLOX:
	ubx_table(device, (on ? ubx_external_enable_table : ubx_external_disable_table));
	break;
    }

    return true;
}

bool gnss_set_constellation(unsigned int mask)
{
    gnss_device_t *device = &gnss_device;

    if (!gnss_done())
    {
	return false;
    }

    switch (device->mode) {
    case GNSS_MODE_NMEA:
	break;
    case GNSS_MODE_MEDIATEK:
	mtk_table(device, ((mask & GNSS_CONSTELLATION_GLONASS) ? mtk_constellation_gps_glonass_table : mtk_constellation_gps_table));
	break;
    case GNSS_MODE_UBLOX:
	ubx_table(device, ((mask & GNSS_CONSTELLATION_GLONASS) ? ubx_constellation_gps_glonass_table : ubx_constellation_gps_table));
	break;
    }

    return true;
}

bool gnss_set_sbas(bool on)
{
    gnss_device_t *device = &gnss_device;

    if (!gnss_done())
    {
	return false;
    }

    switch (device->mode) {
    case GNSS_MODE_NMEA:
	break;
    case GNSS_MODE_MEDIATEK:
	mtk_table(device, (on ? mtk_sbas_enable_table : mtk_sbas_disable_table));
	break;
    case GNSS_MODE_UBLOX:
	ubx_table(device, (on ? ubx_sbas_enable_table : ubx_sbas_disable_table));
	break;
    }

    return true;
}

bool gnss_set_qzss(bool on)
{
    gnss_device_t *device = &gnss_device;

    if (!gnss_done())
    {
	return false;
    }

