GrumpyOldPizza/ArduinoCore-stm32l0/libraries/GNSS/src/utility/gnss_core.c
    switch (device->mode) {
    case GNSS_MODE_NMEA:
	break;
    case GNSS_MODE_MEDIATEK:
	mtk_table(device, (on ? mtk_qzss_enable_table : mtk_qzss_disable_table));
	break;
    case GNSS_MODE_UBLOX:
	ubx_table(device, (on ? ubx_qzss_enable_table : ubx_qzss_disable_table));
	break;
    }

    return true;
}

bool gnss_set_periodic(unsigned int onTime, unsigned int period, bool force)
{
    gnss_device_t *device = &gnss_device;
    const uint8_t **table;
    uint8_t *data;
    unsigned int updatePeriod, searchPeriod;

    if (!gnss_done())
    {
	return false;
    }

    switch (device->mode) {
    case GNSS_MODE_NMEA:
    case GNSS_MODE_MEDIATEK:
	break;
    case GNSS_MODE_UBLOX:
	if (onTime == 0)
	{
	    updatePeriod = 1000;
	    searchPeriod = 10000;
	}
	else
	{
	    updatePeriod = period * 1000;
	    searchPeriod = period * 1000;
	}

	data = &device->tx_data[0];
	table = &device->tx_table[0];

	memset(&data[0], 0, sizeof(GNSS_TX_DATA_SIZE));
	
	data[ 0] = 0xb5;
	data[ 1] = 0x62;
	data[ 2] = 0x06;
	data[ 3] = 0x3b;
	data[ 4] = 0x2c;
	data[ 5] = 0x00;
	data[ 6] = 0x01;
	data[10] = 0x00;
	data[11] = 0x01;
	data[12] = ((onTime && (updatePeriod >= 10000)) ? (force ? 0x01 : 0x00) : 0x02);
	data[13] = 0x00;
	data[14] = updatePeriod >>  0;
	data[15] = updatePeriod >>  8;
	data[16] = updatePeriod >> 16;
	data[17] = updatePeriod >> 24;
	data[18] = searchPeriod >>  0;
	data[19] = searchPeriod >>  8;
	data[20] = searchPeriod >> 16;
	data[21] = searchPeriod >> 24;
	data[26] = onTime >> 0;
	data[27] = onTime >> 8;
	
	ubx_checksum(device, data);

	table[0] = ubx_cfg_rxm_continuous;
	table[1] = &data[0];

	if (onTime)
	{
	    table[2] = ubx_cfg_rxm_powersave;
	    table[3] = ubx_cfg_save;
	    table[4] = NULL;
	}
	else
	{
	    table[2] = ubx_cfg_save;
	    table[3] = NULL;
	}

	device->table = table + 1;

	ubx_send(device, table[0]);
    }

    return true;
}

bool gnss_sleep(void)
{
    gnss_device_t *device = &gnss_device;

    if (!gnss_done())
    {
	return false;
    }

    switch (device->mode) {
    case GNSS_MODE_NMEA:
    case GNSS_MODE_MEDIATEK:
	break;
    case GNSS_MODE_UBLOX:
	ubx_send(device, ubx_rxm_pmreq);
	break;
    }

    return true;
}

bool gnss_wakeup(void)
{
    gnss_device_t *device = &gnss_device;

    if (!gnss_done())
    {
	return false;
    }

    switch (device->mode) {
    case GNSS_MODE_NMEA:
    case GNSS_MODE_MEDIATEK:
	break;
    case GNSS_MODE_UBLOX:
	ubx_send(device, ubx_cfg_rxm_continuous);
	break;
    }

    return true;
}

bool gnss_done(void)
{
    gnss_device_t *device = &gnss_device;

    if (device->table != NULL)
    {
	return false;
    }

    if (device->busy)
    {
	return false;
    }

    return true;
}
